{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          3
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<BOS>": 2,
      "<EOS>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "°": 111,
      "±": 112,
      "²": 113,
      "³": 114,
      "´": 115,
      "µ": 116,
      "¶": 117,
      "·": 118,
      "¸": 119,
      "¹": 120,
      "º": 121,
      "»": 122,
      "¼": 123,
      "½": 124,
      "¾": 125,
      "¿": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "È": 132,
      "Ê": 133,
      "Ë": 134,
      "Ì": 135,
      "Í": 136,
      "Î": 137,
      "Ï": 138,
      "Ð": 139,
      "Ñ": 140,
      "Ò": 141,
      "Ó": 142,
      "Ô": 143,
      "Õ": 144,
      "Ö": 145,
      "×": 146,
      "Ø": 147,
      "Ú": 148,
      "Ý": 149,
      "á": 150,
      "â": 151,
      "ã": 152,
      "å": 153,
      "ç": 154,
      "è": 155,
      "ï": 156,
      "ð": 157,
      "ĉ": 158,
      "Ċ": 159,
      "Č": 160,
      "č": 161,
      "Ġ": 162,
      "Ģ": 163,
      "ģ": 164,
      "Ĥ": 165,
      "ĥ": 166,
      "Ħ": 167,
      "Ĩ": 168,
      "Ī": 169,
      "ī": 170,
      "Ĭ": 171,
      "ĭ": 172,
      "Į": 173,
      "į": 174,
      "ı": 175,
      "Ĳ": 176,
      "ĳ": 177,
      "Ĵ": 178,
      "ĵ": 179,
      "Ķ": 180,
      "ķ": 181,
      "ĸ": 182,
      "Ĺ": 183,
      "ĺ": 184,
      "Ļ": 185,
      "ļ": 186,
      "Ľ": 187,
      "ľ": 188,
      "Ŀ": 189,
      "ŀ": 190,
      "Ł": 191,
      "ł": 192,
      "Ń": 193,
      "ĠĠ": 194,
      "ĠĠĠĠ": 195,
      "čĊ": 196,
      "ĠĠĠĠĠĠĠĠ": 197,
      "in": 198,
      "Ġ*": 199,
      "er": 200,
      "de": 201,
      "==": 202,
      "on": 203,
      "re": 204,
      "ĠĠĠ": 205,
      "Ġt": 206,
      "st": 207,
      "at": 208,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 209,
      "def": 210,
      "en": 211,
      "--": 212,
      "Ġ0": 213,
      "ine": 214,
      "it": 215,
      "/*": 216,
      "Ġ*/": 217,
      "define": 218,
      "Ġc": 219,
      "or": 220,
      "he": 221,
      "al": 222,
      "ion": 223,
      "====": 224,
      "Ġa": 225,
      "Ġ(": 226,
      "le": 227,
      "int": 228,
      "se": 229,
      "Ġb": 230,
      "**": 231,
      "ar": 232,
      "00": 233,
      "es": 234,
      "Ġ/*": 235,
      "Ġthe": 236,
      "ct": 237,
      "Ġ_": 238,
      "IN": 239,
      "Ġf": 240,
      "Ġu": 241,
      "is": 242,
      "Ġp": 243,
      "ed": 244,
      "if": 245,
      "an": 246,
      "ut": 247,
      "----": 248,
      "ĠT": 249,
      "Ġs": 250,
      "ĠC": 251,
      "ĠS": 252,
      "Ġo": 253,
      "ic": 254,
      "Ġm": 255,
      "ER": 256,
      "am": 257,
      "Ġre": 258,
      "ri": 259,
      "ĠR": 260,
      "========": 261,
      "Ġ@": 262,
      "pt": 263,
      "as": 264,
      "ro": 265,
      "//": 266,
      "ES": 267,
      "ĠA": 268,
      ");": 269,
      "ĠP": 270,
      "Ġin": 271,
      "Ġto": 272,
      "ing": 273,
      "ĠĠĠĠĠĠĠ": 274,
      "ur": 275,
      "et": 276,
      "pe": 277,
      "ac": 278,
      "Ġ=": 279,
      "****": 280,
      "Ġ1": 281,
      "EN": 282,
      "OR": 283,
      "Ġn": 284,
      "Ġw": 285,
      "ST": 286,
      "ĠĠĠĠĠ": 287,
      "32": 288,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 289,
      "Ġ__": 290,
      "Ġcon": 291,
      "lo": 292,
      "Ġst": 293,
      "Ġof": 294,
      "ĠI": 295,
      "ON": 296,
      "id": 297,
      "ent": 298,
      "::": 299,
      "Ġ\\": 300,
      "Ġuint": 301,
      "Ġ{": 302,
      "ad": 303,
      "ul": 304,
      "Ġd": 305,
      "AT": 306,
      "el": 307,
      "SE": 308,
      "ĠM": 309,
      "Ġv": 310,
      "IT": 311,
      "RE": 312,
      "ru": 313,
      "ble": 314,
      "lu": 315,
      "im": 316,
      "esp": 317,
      "aram": 318,
      "CL": 319,
      "un": 320,
      "ĠD": 321,
      "ig": 322,
      "ex": 323,
      "os": 324,
      "--------": 325,
      "ype": 326,
      "ĠE": 327,
      "!<": 328,
      "Ġ/*!<": 329,
      "om": 330,
      "Ġis": 331,
      "ist": 332,
      "ĠL": 333,
      "ff": 334,
      "end": 335,
      "Ġbit": 336,
      "able": 337,
      "ation": 338,
      "ED": 339,
      "CH": 340,
      "ue": 341,
      "um": 342,
      "Ġan": 343,
      "AL": 344,
      "PI": 345,
      "ter": 346,
      "param": 347,
      "ol": 348,
      "AR": 349,
      "TR": 350,
      "ag": 351,
      "urn": 352,
      "/**": 353,
      "ot": 354,
      "Ġth": 355,
      "ce": 356,
      "res": 357,
      "Ġ:": 358,
      "__": 359,
      "il": 360,
      "ode": 361,
      "ate": 362,
      "iz": 363,
      "Ġfor": 364,
      "ĠB": 365,
      "turn": 366,
      "================": 367,
      "ĠF": 368,
      "ction": 369,
      "ĠU": 370,
      "Ġl": 371,
      "INT": 372,
      "MA": 373,
      "ata": 374,
      "ĠG": 375,
      "ask": 376,
      "Ġ}": 377,
      "Ġconst": 378,
      "LE": 379,
      "em": 380,
      "UL": 381,
      "ĠĠĠĠĠĠ": 382,
      "con": 383,
      "Ġbe": 384,
      "Ġint": 385,
      "ers": 386,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 387,
      "DE": 388,
      "Ġh": 389,
      "us": 390,
      "********": 391,
      "set": 392,
      "Ġ2": 393,
      "ult": 394,
      "ef": 395,
      "ME": 396,
      "Ġ-": 397,
      "and": 398,
      "oid": 399,
      "<<": 400,
      "ĠO": 401,
      "ize": 402,
      "ption": 403,
      "Ġ//": 404,
      "ESP": 405,
      "TI": 406,
      "Ġand": 407,
      "put": 408,
      "ve": 409,
      "ZB": 410,
      "0000": 411,
      "th": 412,
      "ruct": 413,
      "loc": 414,
      "ch": 415,
      "ĠN": 416,
      "uff": 417,
      "pp": 418,
      "AD": 419,
      "FF": 420,
      "alue": 421,
      "16": 422,
      "Ġch": 423,
      "ID": 424,
      "all": 425,
      "TL": 426,
      "),": 427,
      "ition": 428,
      "ver": 429,
      "ack": 430,
      "FI": 431,
      "clu": 432,
      "ess": 433,
      "ip": 434,
      "UT": 435,
      "rib": 436,
      "Ġ#": 437,
      "AC": 438,
      "type": 439,
      "ĠThe": 440,
      "ĠESP": 441,
      "01": 442,
      "ribut": 443,
      "gist": 444,
      "Ġ\"": 445,
      "Ġon": 446,
      "))": 447,
      "ĠĠĠĠĠĠĠĠĠ": 448,
      "ith": 449,
      "SI": 450,
      "bri": 451,
      "brief": 452,
      "ERR": 453,
      "Ġreturn": 454,
      "ZCL": 455,
      "Ġde": 456,
      "ĠIn": 457,
      "Ġg": 458,
      "endif": 459,
      "ĠW": 460,
      "IC": 461,
      "oint": 462,
      "OM": 463,
      "clude": 464,
      "ay": 465,
      "Ġif": 466,
      "AN": 467,
      "Ġun": 468,
      "ke": 469,
      "----------------": 470,
      "ault": 471,
      "ame": 472,
      "()": 473,
      "PR": 474,
      "gister": 475,
      "op": 476,
      "ĠZB": 477,
      "AS": 478,
      "Ġby": 479,
      "Ġ[": 480,
      "US": 481,
      "OC": 482,
      "ort": 483,
      "ase": 484,
      "ile": 485,
      "include": 486,
      "ator": 487,
      "TC": 488,
      "Ġe": 489,
      "unction": 490,
      "Ġor": 491,
      "ser": 492,
      "ure": 493,
      "nt": 494,
      "ĉĉ": 495,
      "IP": 496,
      "up": 497,
      "Ġ/**": 498,
      "uffer": 499,
      "TLS": 500,
      "Ġnot": 501,
      "Ġthis": 502,
      "MEM": 503,
      "dd": 504,
      "ign": 505,
      "li": 506,
      "Ġstruct": 507,
      "ext": 508,
      "age": 509,
      "omm": 510,
      "default": 511,
      "ress": 512,
      "oc": 513,
      "ĠH": 514,
      "Ġ&": 515,
      "Ġuse": 516,
      "sp": 517,
      "zb": 518,
      "ace": 519,
      "ap": 520,
      "tribut": 521,
      "Ġen": 522,
      "art": 523,
      "void": 524,
      "are": 525,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 526,
      "sc": 527,
      "ORT": 528,
      "osition": 529,
      "SA": 530,
      "UN": 531,
      "lock": 532,
      "err": 533,
      "DR": 534,
      "ptions": 535,
      "Ġvalue": 536,
      "PIO": 537,
      "Ġwith": 538,
      "omp": 539,
      "ime": 540,
      "du": 541,
      "Ġmask": 542,
      "Bit": 543,
      "rupt": 544,
      "ĠRe": 545,
      "ite": 546,
      "BED": 547,
      "Ġ;": 548,
      "ĠTh": 549,
      "EC": 550,
      "atic": 551,
      "add": 552,
      "Ġwh": 553,
      "BEDTLS": 554,
      "cc": 555,
      "..": 556,
      "CON": 557,
      "ran": 558,
      "fig": 559,
      "SR": 560,
      "CR": 561,
      "ir": 562,
      "Ġesp": 563,
      "oun": 564,
      "LI": 565,
      "ht": 566,
      "cl": 567,
      "uint": 568,
      "ING": 569,
      "FR": 570,
      "out": 571,
      "pos": 572,
      "->": 573,
      "per": 574,
      "key": 575,
      "Ġsu": 576,
      "ved": 577,
      "DI": 578,
      "fl": 579,
      "ool": 580,
      "return": 581,
      "vent": 582,
      "ly": 583,
      "qu": 584,
      "iel": 585,
      "Ġfunction": 586,
      "Ġse": 587,
      "ield": 588,
      "ect": 589,
      "ice": 590,
      "ense": 591,
      "ore": 592,
      "defined": 593,
      "Ġsize": 594,
      "BIT": 595,
      "Ġ3": 596,
      "Ġposition": 597,
      "Ġ<": 598,
      "****************": 599,
      "Ġat": 600,
      "Ġdata": 601,
      "MP": 602,
      "ET": 603,
      "icense": 604,
      "ENT": 605,
      "REG": 606,
      "ĠThis": 607,
      "];": 608,
      "ow": 609,
      "Options": 610,
      "ĠUS": 611,
      "SEL": 612,
      "Ġal": 613,
      "atus": 614,
      "nel": 615,
      "der": 616,
      "MO": 617,
      "ast": 618,
      "================================": 619,
      "Ġpro": 620,
      "SY": 621,
      "Ġregister": 622,
      "UP": 623,
      "ment": 624,
      "ART": 625,
      "Ġvoid": 626,
      "tribute": 627,
      "Ġinter": 628,
      "od": 629,
      "rom": 630,
      "const": 631,
      "low": 632,
      "cp": 633,
      "typedef": 634,
      "Ġit": 635,
      "VE": 636,
      "bit": 637,
      "In": 638,
      "Ġadd": 639,
      "val": 640,
      "CP": 641,
      "Ġthat": 642,
      "St": 643,
      "ATTR": 644,
      "pl": 645,
      "*/": 646,
      "AB": 647,
      "Pos": 648,
      "annel": 649,
      "ĠGPIO": 650,
      "FIG": 651,
      "Id": 652,
      "bu": 653,
      "Ġchar": 654,
      "ĠEn": 655,
      "ial": 656,
      "ommand": 657,
      "ifi": 658,
      "Ġdefault": 659,
      "Ġ4": 660,
      "te": 661,
      "ity": 662,
      "Ġex": 663,
      "ls": 664,
      "Type": 665,
      "yp": 666,
      "Ġ+": 667,
      "OUT": 668,
      "SL": 669,
      "ĠV": 670,
      "02": 671,
      "gth": 672,
      "ĠCON": 673,
      "ber": 674,
      "ash": 675,
      "YP": 676,
      "Ġ<<": 677,
      "ĠĠĠĠĠĠĠĠĠĠ": 678,
      "SC": 679,
      "000000": 680,
      "pr": 681,
      "bed": 682,
      "ĠčĊ": 683,
      "OL": 684,
      "ge": 685,
      "OT": 686,
      "ss": 687,
      "vice": 688,
      "read": 689,
      "Ġset": 690,
      "64": 691,
      "of": 692,
      "EX": 693,
      "DC": 694,
      "Ġcont": 695,
      "roup": 696,
      "bm": 697,
      "ITY": 698,
      "addr": 699,
      "ĠCon": 700,
      "ill": 701,
      "ĠTC": 702,
      "ry": 703,
      "rig": 704,
      "Ġout": 705,
      "AP": 706,
      "SFR": 707,
      "OP": 708,
      "ache": 709,
      "tls": 710,
      "ub": 711,
      "bp": 712,
      "PORT": 713,
      "data": 714,
      "sk": 715,
      "Ġzb": 716,
      "ive": 717,
      "USE": 718,
      "ccess": 719,
      "ster": 720,
      "Ġcall": 721,
      "gc": 722,
      "TH": 723,
      "Ġr": 724,
      "ain": 725,
      "ĠInter": 726,
      "CTR": 727,
      "Ġ|": 728,
      "15": 729,
      "umber": 730,
      "BU": 731,
      "imer": 732,
      "que": 733,
      "point": 734,
      "lic": 735,
      "size": 736,
      "opy": 737,
      "12": 738,
      "AG": 739,
      "IOM": 740,
      "MODE": 741,
      "CE": 742,
      "ust": 743,
      "ĠSe": 744,
      "line": 745,
      "STAT": 746,
      "ĠSt": 747,
      "UM": 748,
      "FL": 749,
      "amesp": 750,
      "get": 751,
      "back": 752,
      "ĠMBEDTLS": 753,
      "amespace": 754,
      "CN": 755,
      "iv": 756,
      "(__": 757,
      "RA": 758,
      "ated": 759,
      "Msk": 760,
      "act": 761,
      "ou": 762,
      "OW": 763,
      "rol": 764,
      "ptr": 765,
      "bedtls": 766,
      "Ġbuffer": 767,
      "10": 768,
      "sign": 769,
      "Ġfrom": 770,
      "pec": 771,
      "Ġare": 772,
      "VAL": 773,
      "Ġdefined": 774,
      "IL": 775,
      "BC": 776,
      "ĠSPI": 777,
      "ĠLicense": 778,
      "ide": 779,
      "ma": 780,
      "Ġtype": 781,
      "Ġkey": 782,
      "orm": 783,
      "ength": 784,
      "Ġmode": 785,
      "ens": 786,
      "LOC": 787,
      "TO": 788,
      "Ġas": 789,
      "scri": 790,
      "ino": 791,
      "rans": 792,
      "ener": 793,
      "ha": 794,
      "ific": 795,
      "ep": 796,
      "IM": 797,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 798,
      "CTRL": 799,
      "Ġused": 800,
      "duino": 801,
      "num": 802,
      "io": 803,
      "ĠUSB": 804,
      "ename": 805,
      "Ġbitpos": 806,
      "ointer": 807,
      "Ġne": 808,
      "ire": 809,
      "uil": 810,
      "essage": 811,
      "KE": 812,
      "ypename": 813,
      "Ġper": 814,
      "andle": 815,
      "VER": 816,
      "FA": 817,
      "Ġ((": 818,
      "tr": 819,
      "Ġsh": 820,
      "Ġ5": 821,
      "our": 822,
      "ĠInterrupt": 823,
      "struct": 824,
      "Ġreser": 825,
      "Ġinput": 826,
      "ther": 827,
      "XX": 828,
      "MS": 829,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 830,
      "error": 831,
      "ard": 832,
      "ware": 833,
      "Ġreserved": 834,
      "field": 835,
      "Ġwill": 836,
      "DMA": 837,
      "ION": 838,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 839,
      "tern": 840,
      "UR": 841,
      "Mask": 842,
      "vel": 843,
      "Ġx": 844,
      "TYP": 845,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 846,
      "SP": 847,
      "--------------------------------": 848,
      "ary": 849,
      "Ġaddress": 850,
      "right": 851,
      "ERROR": 852,
      "Ġenable": 853,
      "Ġstatic": 854,
      "signed": 855,
      "ĠSet": 856,
      "ĠAN": 857,
      "luster": 858,
      "ec": 859,
      "IS": 860,
      "TYPE": 861,
      "lement": 862,
      "ĠOR": 863,
      "Ġus": 864,
      "Ġ6": 865,
      "buf": 866,
      "EV": 867,
      "PD": 868,
      "ZE": 869,
      "ĠCONFIG": 870,
      "rite": 871,
      "ĠEnable": 872,
      "Data": 873,
      "CM": 874,
      "CLK": 875,
      "fer": 876,
      "HA": 877,
      "Ġend": 878,
      "uffers": 879,
      "Ġspec": 880,
      "ass": 881,
      "br": 882,
      "SER": 883,
      "HE": 884,
      "Ġ==": 885,
      "Ġval": 886,
      "use": 887,
      "ote": 888,
      "PIN": 889,
      "ĠRTC": 890,
      "her": 891,
      "Ġinterrupt": 892,
      "ULL": 893,
      "20": 894,
      "Ġconfig": 895,
      "Bitfield": 896,
      "MU": 897,
      "Ġoutput": 898,
      "Ġcomp": 899,
      "ring": 900,
      "11": 901,
      "ĠGet": 902,
      "tes": 903,
      "ĠEV": 904,
      "SYS": 905,
      "Ġnumber": 906,
      "ount": 907,
      "SET": 908,
      "ĠOF": 909,
      "IO": 910,
      "Ġy": 911,
      "Ġ/**<": 912,
      "ifdef": 913,
      "DAT": 914,
      "ACK": 915,
      "form": 916,
      "Ġoper": 917,
      "AM": 918,
      "SIZE": 919,
      "ost": 920,
      "(_": 921,
      "scription": 922,
      "Con": 923,
      "25": 924,
      "ull": 925,
      "Ġbool": 926,
      "Ġ!": 927,
      "ICE": 928,
      "Ġmbedtls": 929,
      "Ġcan": 930,
      "LOCK": 931,
      "CC": 932,
      "GLI": 933,
      "Ar": 934,
      "();": 935,
      "EM": 936,
      "ESH": 937,
      "Ġwhen": 938,
      "ĠADC": 939,
      "MAX": 940,
      "ory": 941,
      "trol": 942,
      "Ġle": 943,
      "buffers": 944,
      "static": 945,
      "UNC": 946,
      "ĠRegister": 947,
      "Ġ7": 948,
      "Ġmust": 949,
      "eg": 950,
      "atbuffers": 951,
      "zcl": 952,
      "TX": 953,
      "ret": 954,
      "oft": 955,
      "FO": 956,
      "ax": 957,
      "ail": 958,
      "ance": 959,
      "END": 960,
      "ual": 961,
      "WA": 962,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 963,
      "03": 964,
      "ĠCh": 965,
      "fo": 966,
      "ĠIN": 967,
      "Ġerror": 968,
      "BA": 969,
      "Ġ8": 970,
      "sa": 971,
      "flatbuffers": 972,
      "Ġ`": 973,
      "ĠCH": 974,
      "ersion": 975,
      "Ġcommand": 976,
      "oul": 977,
      "CNT": 978,
      "EP": 979,
      "TION": 980,
      "istribut": 981,
      "BLE": 982,
      "FFFF": 983,
      "lect": 984,
      "ould": 985,
      "Ġ};": 986,
      "WIP": 987,
      "len": 988,
      "((": 989,
      "COR": 990,
      "Ġparam": 991,
      "else": 992,
      "urre": 993,
      "Ġtime": 994,
      "tin": 995,
      "WM": 996,
      "dex": 997,
      "<_": 998,
      "xf": 999,
      "COM": 1000,
      "Ġk": 1001,
      "FUNC": 1002,
      "ant": 1003,
      "Ġmem": 1004,
      "};": 1005,
      "pro": 1006,
      "ource": 1007,
      ").": 1008,
      "mode": 1009,
      "yst": 1010,
      "ence": 1011,
      "Iter": 1012,
      "ESS": 1013,
      "iss": 1014,
      "esh": 1015,
      "ave": 1016,
      "description": 1017,
      "GLIBC": 1018,
      "TER": 1019,
      "GLIBCXX": 1020,
      "Ġim": 1021,
      "uration": 1022,
      "lus": 1023,
      "ll": 1024,
      "EL": 1025,
      "ADDR": 1026,
      "ACH": 1027,
      "EST": 1028,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1029,
      "yn": 1030,
      "opyright": 1031,
      "expr": 1032,
      "rit": 1033,
      "ree": 1034,
      "LO": 1035,
      "Ġsuccess": 1036,
      "KEY": 1037,
      "ck": 1038,
      "empl": 1039,
      "Ġchannel": 1040,
      "SPI": 1041,
      "ABLE": 1042,
      "Ġ&&": 1043,
      "IG": 1044,
      "itial": 1045,
      "isable": 1046,
      "CT": 1047,
      "Ġfile": 1048,
      "Ġpointer": 1049,
      "app": 1050,
      "Re": 1051,
      "Ġar": 1052,
      "load": 1053,
      "CLR": 1054,
      "Ġapp": 1055,
      "RO": 1056,
      "emplate": 1057,
      "ĠFI": 1058,
      "led": 1059,
      "oftware": 1060,
      "RX": 1061,
      "ĠX": 1062,
      "ystem": 1063,
      "MBEDTLS": 1064,
      "Ġattribute": 1065,
      "urrent": 1066,
      "quest": 1067,
      "WI": 1068,
      "PU": 1069,
      "one": 1070,
      "OST": 1071,
      "irst": 1072,
      "Ġgroup": 1073,
      "ffset": 1074,
      "********************************": 1075,
      ">(": 1076,
      "ĠIf": 1077,
      "Ġconstexpr": 1078,
      "lag": 1079,
      "ind": 1080,
      "ission": 1081,
      "ndef": 1082,
      "ne": 1083,
      "ifier": 1084,
      "PER": 1085,
      "04": 1086,
      ")(": 1087,
      "cb": 1088,
      "lease": 1089,
      "Ġaut": 1090,
      "PO": 1091,
      "NUM": 1092,
      "ifndef": 1093,
      "Ġmay": 1094,
      "MESH": 1095,
      "ove": 1096,
      "ĠEVSYS": 1097,
      "14": 1098,
      "OK": 1099,
      "value": 1100,
      "13": 1101,
      "Ġread": 1102,
      "lib": 1103,
      "reg": 1104,
      "cond": 1105,
      "cplu": 1106,
      "splus": 1107,
      "cplusplus": 1108,
      "Ġ>": 1109,
      "Ġunsigned": 1110,
      "DATA": 1111,
      "Ġlist": 1112,
      "Ġenum": 1113,
      "ARG": 1114,
      "Ġstatus": 1115,
      "to": 1116,
      "08": 1117,
      "ify": 1118,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1119,
      "Ġevent": 1120,
      "lient": 1121,
      "cast": 1122,
      "pport": 1123,
      "CORE": 1124,
      ":[": 1125,
      "bitpos": 1126,
      "UE": 1127,
      "pack": 1128,
      "URE": 1129,
      "Ġinline": 1130,
      "ENA": 1131,
      "USB": 1132,
      "erator": 1133,
      "LIN": 1134,
      "ang": 1135,
      "ĠNULL": 1136,
      "Ġ///": 1137,
      "ages": 1138,
      "Ġ================================": 1139,
      "Loc": 1140,
      "Ġstd": 1141,
      "Ġlength": 1142,
      "Ġres": 1143,
      "extern": 1144,
      "ĠEvent": 1145,
      "En": 1146,
      "BASE": 1147,
      "Ġother": 1148,
      "Ġcode": 1149,
      "rypt": 1150,
      "rc": 1151,
      "ounter": 1152,
      "old": 1153,
      "Ġnamespace": 1154,
      "atch": 1155,
      "ich": 1156,
      "ENS": 1157,
      "ublic": 1158,
      "FOR": 1159,
      "ĠLWIP": 1160,
      "ded": 1161,
      "mesh": 1162,
      "ĠCHIP": 1163,
      "Ġunion": 1164,
      "LV": 1165,
      "Ġunder": 1166,
      "Ġdo": 1167,
      "ACHE": 1168,
      "ature": 1169,
      "nal": 1170,
      "time": 1171,
      "OF": 1172,
      "PSA": 1173,
      "ait": 1174,
      "wor": 1175,
      "ĠUn": 1176,
      "namespace": 1177,
      "ĠPORT": 1178,
      "ĠAt": 1179,
      "Ġfield": 1180,
      "text": 1181,
      "port": 1182,
      "Ġshould": 1183,
      "CO": 1184,
      "ight": 1185,
      "RES": 1186,
      "Ġ.": 1187,
      "ĠTHE": 1188,
      "Ġusing": 1189,
      "ref": 1190,
      "ADC": 1191,
      "CPWM": 1192,
      "bj": 1193,
      "Ġcal": 1194,
      "ab": 1195,
      "Ġ::": 1196,
      "ATION": 1197,
      "VALID": 1198,
      "ensor": 1199,
      "ĠComp": 1200,
      "ler": 1201,
      "Ġonly": 1202,
      "CMD": 1203,
      "config": 1204,
      "Tp": 1205,
      "cept": 1206,
      "ms": 1207,
      "Ġbytes": 1208,
      "Ġstate": 1209,
      "App": 1210,
      "Ġcallback": 1211,
      "ITH": 1212,
      "Ġi": 1213,
      "Ġtypename": 1214,
      "Ġcase": 1215,
      "Ġwhich": 1216,
      "CONFIG": 1217,
      "ong": 1218,
      "ere": 1219,
      "mp": 1220,
      "aw": 1221,
      "CLU": 1222,
      "CHAN": 1223,
      "Ġsign": 1224,
      "pd": 1225,
      "Arduino": 1226,
      "reate": 1227,
      "GEN": 1228,
      "Ġ)": 1229,
      "TE": 1230,
      "NC": 1231,
      "Local": 1232,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1233,
      "ALL": 1234,
      "heck": 1235,
      "ĠFILE": 1236,
      "Ġdevice": 1237,
      "Ġmessage": 1238,
      "Ġnet": 1239,
      "PL": 1240,
      "inter": 1241,
      "ibr": 1242,
      "FUSE": 1243,
      "ECT": 1244,
      "STR": 1245,
      "ULT": 1246,
      "Ġinst": 1247,
      "ĠANY": 1248,
      "og": 1249,
      ":\\": 1250,
      "MT": 1251,
      "Ġ16": 1252,
      "Ġimp": 1253,
      "dc": 1254,
      "RAN": 1255,
      "Ġfa": 1256,
      "Ġ================================================": 1257,
      "sed": 1258,
      "code": 1259,
      "net": 1260,
      "md": 1261,
      "flite": 1262,
      "sers": 1263,
      "Ġtrans": 1264,
      "SK": 1265,
      "SU": 1266,
      "head": 1267,
      "));": 1268,
      "Ġoperation": 1269,
      "GPIO": 1270,
      "SUP": 1271,
      "GE": 1272,
      "09": 1273,
      "note": 1274,
      "vect": 1275,
      "ink": 1276,
      "ipher": 1277,
      "ĠControl": 1278,
      "Buffer": 1279,
      "NO": 1280,
      "est": 1281,
      "Ġyou": 1282,
      "ĠMode": 1283,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1284,
      "Ġhas": 1285,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1286,
      "Users": 1287,
      "Mode": 1288,
      "AppData": 1289,
      "asus": 1290,
      "DT": 1291,
      "INVALID": 1292,
      "Ġrece": 1293,
      "uiltin": 1294,
      "hal": 1295,
      "hash": 1296,
      "Iterator": 1297,
      "Ġser": 1298,
      "std": 1299,
      "Ġprov": 1300,
      "CB": 1301,
      "SERT": 1302,
      "Ġendpoint": 1303,
      "Ġmemory": 1304,
      "Ġcontext": 1305,
      "lat": 1306,
      "Ke": 1307,
      "lection": 1308,
      "TIME": 1309,
      "Ġchip": 1310,
      "igh": 1311,
      "Ġstart": 1312,
      "TIM": 1313,
      "QU": 1314,
      "lear": 1315,
      "Ġno": 1316,
      "ector": 1317,
      "dule": 1318,
      "ak": 1319,
      "bb": 1320,
      "07": 1321,
      "////": 1322,
      "ĠDef": 1323,
      "ASSERT": 1324,
      "ized": 1325,
      "BLOCK": 1326,
      "gp": 1327,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1328,
      "arduino": 1329,
      "Ġ||": 1330,
      "MAN": 1331,
      "24": 1332,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1333,
      "FG": 1334,
      "PRICE": 1335,
      "Ġwrit": 1336,
      "ĠMCPWM": 1337,
      "ived": 1338,
      "onse": 1339,
      "Ġparamet": 1340,
      "BL": 1341,
      "MUX": 1342,
      "tributes": 1343,
      "Ġcl": 1344,
      "Ġsp": 1345,
      "alse": 1346,
      "ange": 1347,
      "OV": 1348,
      "ools": 1349,
      "SUPPORT": 1350,
      "sha": 1351,
      "amp": 1352,
      "##": 1353,
      "ACE": 1354,
      "name": 1355,
      "typename": 1356,
      "FIFO": 1357,
      "19": 1358,
      "EG": 1359,
      "STATUS": 1360,
      "ĠChannel": 1361,
      "ous": 1362,
      "ĠUN": 1363,
      "packages": 1364,
      "31": 1365,
      "status": 1366,
      "Ġtemplate": 1367,
      "face": 1368,
      "Ġinitial": 1369,
      "28": 1370,
      "EE": 1371,
      "riv": 1372,
      "EDC": 1373,
      "ee": 1374,
      "IV": 1375,
      "tools": 1376,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1377,
      "allback": 1378,
      "Ġsc": 1379,
      "mit": 1380,
      "READ": 1381,
      "STEM": 1382,
      "Ġhandle": 1383,
      "ĠType": 1384,
      "LEN": 1385,
      "Un": 1386,
      "ally": 1387,
      "mission": 1388,
      "ning": 1389,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1390,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1391,
      "uilder": 1392,
      "ĠDMA": 1393,
      "rior": 1394,
      "GP": 1395,
      "dic": 1396,
      "Ġall": 1397,
      "tp": 1398,
      "ĠInput": 1399,
      "WR": 1400,
      "LINE": 1401,
      "Ġact": 1402,
      "Ġspecific": 1403,
      "Ġ========================================================": 1404,
      "Ġapplic": 1405,
      "ise": 1406,
      "dent": 1407,
      "ron": 1408,
      "ĠUSART": 1409,
      "ument": 1410,
      "00000001": 1411,
      "Ġblock": 1412,
      "OptionsT": 1413,
      "list": 1414,
      "ted": 1415,
      "Ġ(*": 1416,
      "PA": 1417,
      "ower": 1418,
      "Key": 1419,
      "Ġdistribut": 1420,
      "80": 1421,
      "ĠDe": 1422,
      "Ġab": 1423,
      "ILITY": 1424,
      "PMS": 1425,
      "FS": 1426,
      "ONE": 1427,
      "Ġauto": 1428,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1429,
      "ĠUNITY": 1430,
      "init": 1431,
      "Ġcalled": 1432,
      "ww": 1433,
      "ake": 1434,
      "Ġsupport": 1435,
      "nect": 1436,
      "OD": 1437,
      "ollow": 1438,
      "rue": 1439,
      "ray": 1440,
      "FAULT": 1441,
      "Ġ(__": 1442,
      "evel": 1443,
      "toc": 1444,
      "CD": 1445,
      "itions": 1446,
      "Ġfollow": 1447,
      "Ch": 1448,
      "ful": 1449,
      "Ġdefine": 1450,
      "bt": 1451,
      "acket": 1452,
      "buffer": 1453,
      "To": 1454,
      "inline": 1455,
      "SIG": 1456,
      "DEV": 1457,
      "action": 1458,
      "quire": 1459,
      "Pro": 1460,
      "dpoint": 1461,
      "ĠBit": 1462,
      "BUG": 1463,
      "Ġpre": 1464,
      "Ġany": 1465,
      "valid": 1466,
      "ĠPro": 1467,
      "Ġbits": 1468,
      "file": 1469,
      "ĠGener": 1470,
      "ĠIS": 1471,
      "Ġtimer": 1472,
      "ĠEx": 1473,
      "'s": 1474,
      "ITE": 1475,
      "Ġsoftware": 1476,
      "000": 1477,
      "BUF": 1478,
      "ath": 1479,
      "own": 1480,
      "ĠID": 1481,
      "work": 1482,
      "dev": 1483,
      "ENABLE": 1484,
      "start": 1485,
      "DB": 1486,
      "IF": 1487,
      "xB": 1488,
      "ĠAdd": 1489,
      "Ġ32": 1490,
      "ting": 1491,
      "tx": 1492,
      "256": 1493,
      "ert": 1494,
      "min": 1495,
      "ger": 1496,
      "ates": 1497,
      "TIER": 1498,
      "loat": 1499,
      "Ġreg": 1500,
      "LVL": 1501,
      "imit": 1502,
      "STER": 1503,
      "xff": 1504,
      "release": 1505,
      "ĠWAR": 1506,
      "CS": 1507,
      "SION": 1508,
      "Ġcluster": 1509,
      "ĉĠ": 1510,
      "irt": 1511,
      "06": 1512,
      "Ġgener": 1513,
      "Ġcurrent": 1514,
      "ACT": 1515,
      "yte": 1516,
      "Ġhave": 1517,
      "At": 1518,
      "Ġprovide": 1519,
      "METER": 1520,
      "gr": 1521,
      "chron": 1522,
      "ations": 1523,
      "SSL": 1524,
      "DEBUG": 1525,
      "ĠPSA": 1526,
      "ari": 1527,
      "18": 1528,
      "ound": 1529,
      "ach": 1530,
      "Ġ%": 1531,
      "ock": 1532,
      "rr": 1533,
      "ident": 1534,
      "Value": 1535,
      "Ġsend": 1536,
      "ĠSPD": 1537,
      "Ġfalse": 1538,
      "START": 1539,
      "iod": 1540,
      "xC": 1541,
      "ibrary": 1542,
      "IND": 1543,
      "IR": 1544,
      "bject": 1545,
      "enc": 1546,
      "License": 1547,
      "SYSTEM": 1548,
      "ĠWARRAN": 1549,
      "imum": 1550,
      "ĠSelection": 1551,
      "ĠSPDX": 1552,
      "ĠZ": 1553,
      "lash": 1554,
      "DES": 1555,
      "ĠAC": 1556,
      "IB": 1557,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1558,
      "ĉĉĉĉ": 1559,
      "acro": 1560,
      "first": 1561,
      "mem": 1562,
      "Ġone": 1563,
      "ision": 1564,
      "ĠSystem": 1565,
      "Ġmax": 1566,
      "Ġrequest": 1567,
      "req": 1568,
      "LS": 1569,
      "resent": 1570,
      "ues": 1571,
      "ĠNV": 1572,
      "ĠData": 1573,
      "De": 1574,
      "PRE": 1575,
      "ord": 1576,
      "Ġsource": 1577,
      "ĠBLE": 1578,
      "tocol": 1579,
      "rec": 1580,
      "86": 1581,
      "Ġfollowing": 1582,
      "resp": 1583,
      "ĠINT": 1584,
      "ĠLEDC": 1585,
      "ilter": 1586,
      "ATE": 1587,
      "ressif": 1588,
      "ĠSOC": 1589,
      "ynchron": 1590,
      "cess": 1591,
      "ix": 1592,
      "alloc": 1593,
      "HT": 1594,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1595,
      "Ġ///<": 1596,
      "MAC": 1597,
      "FAIL": 1598,
      "Ġpart": 1599,
      "Ġversion": 1600,
      "Ġlevel": 1601,
      "ĠIP": 1602,
      "river": 1603,
      "ptor": 1604,
      "pect": 1605,
      "enum": 1606,
      "Ġconfiguration": 1607,
      "MASK": 1608,
      "ĠUART": 1609,
      "libs": 1610,
      "ream": 1611,
      "TEST": 1612,
      "RST": 1613,
      "ĠCompare": 1614,
      "Ġclock": 1615,
      "METERING": 1616,
      "utput": 1617,
      "NEL": 1618,
      "21": 1619,
      "comp": 1620,
      "RTC": 1621,
      "RAW": 1622,
      "Ġwithout": 1623,
      "\");": 1624,
      "List": 1625,
      "Ġcond": 1626,
      "oot": 1627,
      "CUR": 1628,
      "riority": 1629,
      "WOR": 1630,
      "cle": 1631,
      "hold": 1632,
      "lete": 1633,
      "Ġnull": 1634,
      "ĠBuiltin": 1635,
      "CNTL": 1636,
      "ick": 1637,
      "\",": 1638,
      "Ġarg": 1639,
      "retval": 1640,
      "map": 1641,
      "Ġform": 1642,
      "SRV": 1643,
      "ASH": 1644,
      "Ġlo": 1645,
      "ĠEX": 1646,
      "RC": 1647,
      "EXT": 1648,
      "idf": 1649,
      "ĠAp": 1650,
      "ified": 1651,
      "over": 1652,
      "ĠCopyright": 1653,
      "rror": 1654,
      "ys": 1655,
      "Ġcopy": 1656,
      "empt": 1657,
      "LP": 1658,
      "TIMER": 1659,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1660,
      "STATE": 1661,
      "uf": 1662,
      "ĠApache": 1663,
      "05": 1664,
      "Ġalloc": 1665,
      "DP": 1666,
      "IVE": 1667,
      "Ġdis": 1668,
      "Ġtflite": 1669,
      "ĠAPI": 1670,
      "17": 1671,
      "ward": 1672,
      "ultip": 1673,
      "hed": 1674,
      "mbedtls": 1675,
      "ĠSer": 1676,
      "30": 1677,
      "TD": 1678,
      "Ġvol": 1679,
      "ither": 1680,
      "bool": 1681,
      "ycle": 1682,
      "sert": 1683,
      "DO": 1684,
      "odule": 1685,
      "SHA": 1686,
      "Ġsub": 1687,
      "ĠRMT": 1688,
      "ĠTWI": 1689,
      "Ġneed": 1690,
      "input": 1691,
      "atile": 1692,
      "Ġelse": 1693,
      "ater": 1694,
      "Ġstring": 1695,
      "fter": 1696,
      "ĠRO": 1697,
      "Ġtask": 1698,
      "Ġresult": 1699,
      "ĠEFUSE": 1700,
      "TS": 1701,
      "ference": 1702,
      "fbb": 1703,
      "EVENT": 1704,
      "ayload": 1705,
      "attribute": 1706,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1707,
      "ssl": 1708,
      "andler": 1709,
      "ause": 1710,
      "Ġ!=": 1711,
      "CAL": 1712,
      "Ġwrite": 1713,
      "Status": 1714,
      "Al": 1715,
      "RD": 1716,
      "Ġ'": 1717,
      "ions": 1718,
      "Ġimplement": 1719,
      "++": 1720,
      "ten": 1721,
      "info": 1722,
      "Ġcontrol": 1723,
      "xF": 1724,
      "TIES": 1725,
      "AY": 1726,
      "utex": 1727,
      "sters": 1728,
      "DEFAULT": 1729,
      "23": 1730,
      "xD": 1731,
      "Ġpsa": 1732,
      "DING": 1733,
      "Ġent": 1734,
      "PUT": 1735,
      "ABILITY": 1736,
      "Ġident": 1737,
      "Ġget": 1738,
      "CMP": 1739,
      "Ġselect": 1740,
      "ĠCommand": 1741,
      "Ġover": 1742,
      "ample": 1743,
      "UCH": 1744,
      "AGE": 1745,
      "SH": 1746,
      "ĠWARRANTIES": 1747,
      "Info": 1748,
      "xE": 1749,
      "iled": 1750,
      "Ġstructure": 1751,
      "Ġrequire": 1752,
      "Builder": 1753,
      "Ġtrue": 1754,
      "Model": 1755,
      "Offset": 1756,
      "gor": 1757,
      "Ġnew": 1758,
      "WITH": 1759,
      "Ġname": 1760,
      "ĠPort": 1761,
      "Ġelement": 1762,
      "mask": 1763,
      "vert": 1764,
      "VALUE": 1765,
      "range": 1766,
      "HAVE": 1767,
      "rigger": 1768,
      "context": 1769,
      "gorith": 1770,
      "Ġbut": 1771,
      "eas": 1772,
      "ĠMask": 1773,
      "GET": 1774,
      "Ġro": 1775,
      "function": 1776,
      "Ġport": 1777,
      "ĠPer": 1778,
      "wip": 1779,
      "CI": 1780,
      "wise": 1781,
      "MAP": 1782,
      "Ġpacket": 1783,
      "ĠLevel": 1784,
      "Ġpermission": 1785,
      "ynchronous": 1786,
      "MD": 1787,
      "event": 1788,
      "Ġ201": 1789,
      "128": 1790,
      "ĠFor": 1791,
      "26": 1792,
      "Ġclass": 1793,
      "Ġhead": 1794,
      "Ġpin": 1795,
      "Ġpoint": 1796,
      "PAD": 1797,
      "bug": 1798,
      "nection": 1799,
      "src": 1800,
      "lusters": 1801,
      "fg": 1802,
      "reshold": 1803,
      "DS": 1804,
      "Ġwas": 1805,
      "ĠLP": 1806,
      "state": 1807,
      "lusterId": 1808,
      "(\"": 1809,
      "ĠConfig": 1810,
      "...": 1811,
      "ish": 1812,
      "cur": 1813,
      "odable": 1814,
      "22": 1815,
      "MIN": 1816,
      "crypt": 1817,
      "INV": 1818,
      "LL": 1819,
      "ĠAttribute": 1820,
      "group": 1821,
      "(),": 1822,
      "MENT": 1823,
      "ĠTime": 1824,
      "Ġ(@": 1825,
      "Ġdistributed": 1826,
      "ĠFlag": 1827,
      "dr": 1828,
      "lay": 1829,
      "40": 1830,
      "qual": 1831,
      "PACK": 1832,
      "ecodable": 1833,
      "ĠAND": 1834,
      "iterator": 1835,
      "ĠPointer": 1836,
      "Ġwe": 1837,
      "SLC": 1838,
      "flow": 1839,
      "enable": 1840,
      "Ġpublic": 1841,
      "PP": 1842,
      "ĠGDMA": 1843,
      "handle": 1844,
      "Ġmasks": 1845,
      "rame": 1846,
      "Ġexp": 1847,
      "cluster": 1848,
      "SD": 1849,
      "REQ": 1850,
      "ification": 1851,
      "Ġmod": 1852,
      "ok": 1853,
      "rehash": 1854,
      "CONST": 1855,
      "max": 1856,
      "48": 1857,
      "Ġpositions": 1858,
      "comm": 1859,
      "Ġcontain": 1860,
      "Ġdisable": 1861,
      "ĠNVM": 1862,
      "PAR": 1863,
      "ĠTimer": 1864,
      "Ġfunctions": 1865,
      "inary": 1866,
      "sh": 1867,
      "char": 1868,
      "OLD": 1869,
      "IAL": 1870,
      "Ġlen": 1871,
      "ĠRet": 1872,
      "ĠSENS": 1873,
      "tc": 1874,
      "xb": 1875,
      "Ġflag": 1876,
      "ĠCL": 1877,
      "formation": 1878,
      "ctx": 1879,
      "DEVICE": 1880,
      "hread": 1881,
      "ĠOn": 1882,
      "ĠSelect": 1883,
      "xA": 1884,
      "DIO": 1885,
      "str": 1886,
      "par": 1887,
      "ĉĉĉ": 1888,
      "BT": 1889,
      "FLAG": 1890,
      "ead": 1891,
      "ĠPre": 1892,
      "SS": 1893,
      "rehasher": 1894,
      "gm": 1895,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1896,
      "HER": 1897,
      "fL": 1898,
      "ĠPR": 1899,
      "way": 1900,
      "Ġ?": 1901,
      "FORCE": 1902,
      "Ġsuccessful": 1903,
      "TROL": 1904,
      "cal": 1905,
      "ypes": 1906,
      "TP": 1907,
      "Ġenabled": 1908,
      "Ġprovided": 1909,
      "apt": 1910,
      ")->": 1911,
      "Ġ10": 1912,
      "EMP": 1913,
      "base": 1914,
      "RAM": 1915,
      "EVT": 1916,
      "easure": 1917,
      "xd": 1918,
      "Ġht": 1919,
      "Ġ/": 1920,
      "length": 1921,
      "egin": 1922,
      "SW": 1923,
      "Ex": 1924,
      "Ġip": 1925,
      "Ġlibrary": 1926,
      "indow": 1927,
      "write": 1928,
      "Ġlong": 1929,
      "Ġdst": 1930,
      "channel": 1931,
      "AME": 1932,
      "UCT": 1933,
      "rivate": 1934,
      "Sh": 1935,
      "ĠPin": 1936,
      "ĠTrans": 1937,
      "cmd": 1938,
      "SEC": 1939,
      "ome": 1940,
      "fLite": 1941,
      "Ġmet": 1942,
      "OFF": 1943,
      "leep": 1944,
      "VEL": 1945,
      "SAR": 1946,
      "MODEL": 1947,
      "gorithm": 1948,
      "Ġafter": 1949,
      "arget": 1950,
      "USER": 1951,
      "ĠCPU": 1952,
      "Set": 1953,
      "Ġ(_": 1954,
      "38": 1955,
      "pen": 1956,
      "DIV": 1957,
      "OFT": 1958,
      "pected": 1959,
      "shape": 1960,
      "CONTROL": 1961,
      "HOST": 1962,
      "Ġ*_": 1963,
      "Command": 1964,
      "Ġtypedef": 1965,
      "Ġext": 1966,
      "Ġad": 1967,
      "ĠClock": 1968,
      "ĠSD": 1969,
      "last": 1970,
      "SOC": 1971,
      "NOT": 1972,
      "LEVEL": 1973,
      "Ġnullptr": 1974,
      "ĠLI": 1975,
      "ITIVE": 1976,
      "ĠUser": 1977,
      "ization": 1978,
      "ĠSee": 1979,
      "by": 1980,
      "ĠOutput": 1981,
      "ECK": 1982,
      "output": 1983,
      "Ġeither": 1984,
      "WARE": 1985,
      "29": 1986,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1987,
      "ilu": 1988,
      "68": 1989,
      "unsigned": 1990,
      "OVF": 1991,
      "ĠBuiltinOptions": 1992,
      "Inter": 1993,
      "cfg": 1994,
      "ĠPosition": 1995,
      "CHAL": 1996,
      "Ident": 1997,
      "Ġvolatile": 1998,
      "Ġresp": 1999,
      "ose": 2000,
      "Ġrem": 2001,
      "present": 2002,
      "Ġid": 2003,
      "andom": 2004,
      "Ġinto": 2005,
      "ĠReturn": 2006,
      "vail": 2007,
      "netif": 2008,
      "irtual": 2009,
      "clk": 2010,
      "VR": 2011,
      "Ġreceived": 2012,
      "ASY": 2013,
      "Ġcheck": 2014,
      "BUS": 2015,
      "Ġbeen": 2016,
      "fore": 2017,
      "cre": 2018,
      "MST": 2019,
      "sl": 2020,
      "Ġvalues": 2021,
      "Ġstore": 2022,
      "INTR": 2023,
      "agma": 2024,
      "Get": 2025,
      "string": 2026,
      "Endpoint": 2027,
      "Ġ9": 2028,
      "queue": 2029,
      "Ġrequired": 2030,
      "CURR": 2031,
      "ipheral": 2032,
      "Ġz": 2033,
      "count": 2034,
      "print": 2035,
      "INTLVL": 2036,
      "local": 2037,
      "lied": 2038,
      "ĠRed": 2039,
      "PRO": 2040,
      "LY": 2041,
      "Ġfirst": 2042,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2043,
      "Ġbt": 2044,
      "xx": 2045,
      "INTER": 2046,
      "().": 2047,
      "ĠAP": 2048,
      "INIT": 2049,
      "ĠY": 2050,
      "<<(": 2051,
      "Ġsignal": 2052,
      "ĠPMU": 2053,
      "ĠPRO": 2054,
      "see": 2055,
      "Ġbefore": 2056,
      "Task": 2057,
      "ero": 2058,
      "44": 2059,
      "irect": 2060,
      "resol": 2061,
      "attr": 2062,
      "SYNC": 2063,
      "Ġbyte": 2064,
      "Ġgp": 2065,
      "ative": 2066,
      "'t": 2067,
      "PRES": 2068,
      "Add": 2069,
      "Ġspi": 2070,
      "conf": 2071,
      "olor": 2072,
      "Ġapplication": 2073,
      "Ġ>=": 2074,
      "Ġoff": 2075,
      "Ġconditions": 2076,
      "Ġindex": 2077,
      "STRUCT": 2078,
      "UNITY": 2079,
      "ardware": 2080,
      "ĠK": 2081,
      "Ġmacro": 2082,
      "ĠIt": 2083,
      "ERV": 2084,
      "ĠAD": 2085,
      "VECT": 2086,
      "CRYP": 2087,
      "ĠStatus": 2088,
      "ĠRes": 2089,
      "Ġinstance": 2090,
      "ctr": 2091,
      "Ġabove": 2092,
      "ilure": 2093,
      "vailable": 2094,
      ")<<(": 2095,
      ".*/": 2096,
      "si": 2097,
      "aits": 2098,
      "Ġag": 2099,
      "ĠTCA": 2100,
      "apture": 2101,
      "TAG": 2102,
      "Ġvalid": 2103,
      "ĠTO": 2104,
      "://": 2105,
      "Ġoperator": 2106,
      "Ġindic": 2107,
      "CHECK": 2108,
      "ared": 2109,
      "ical": 2110,
      "ASYNC": 2111,
      "Ġonce": 2112,
      "APP": 2113,
      "ERRUP": 2114,
      "TIC": 2115,
      "ĉĠĠĠ": 2116,
      "LD": 2117,
      "ĠEsp": 2118,
      "CLI": 2119,
      "BUFF": 2120,
      "/*!": 2121,
      "Ġinclude": 2122,
      "MON": 2123,
      "ĠRead": 2124,
      "pragma": 2125,
      "Ġinterface": 2126,
      "Ġpr": 2127,
      "message": 2128,
      "Ġup": 2129,
      "CLUDING": 2130,
      "ĠAs": 2131,
      "empty": 2132,
      "ĠCLK": 2133,
      "ride": 2134,
      "Int": 2135,
      "Vector": 2136,
      "ding": 2137,
      "Ġdoes": 2138,
      "27": 2139,
      "LOG": 2140,
      "spi": 2141,
      "IFI": 2142,
      "ĠSoftware": 2143,
      "VI": 2144,
      "ASK": 2145,
      "ync": 2146,
      "CURRENT": 2147,
      "HY": 2148,
      "Ġparameter": 2149,
      "SSI": 2150,
      "98": 2151,
      "Ġass": 2152,
      "ariable": 2153,
      "CHANNEL": 2154,
      "anag": 2155,
      "Ġret": 2156,
      "Ġso": 2157,
      "VECTOR": 2158,
      "BY": 2159,
      "not": 2160,
      "Ġhttp": 2161,
      "scriptor": 2162,
      "Attribute": 2163,
      "ĠFOR": 2164,
      "----------------------------------------------------------------": 2165,
      "REF": 2166,
      "pdate": 2167,
      "CAN": 2168,
      "idth": 2169,
      "Char": 2170,
      "FLASH": 2171,
      "ecut": 2172,
      "for": 2173,
      "offset": 2174,
      "THR": 2175,
      "Ġinitialized": 2176,
      "PROT": 2177,
      "xFFFF": 2178,
      "fs": 2179,
      "BUFFER": 2180,
      "Ġcycle": 2181,
      "OFTWARE": 2182,
      "Alloc": 2183,
      "Ġfailed": 2184,
      "ĠSystems": 2185,
      "ating": 2186,
      "ALG": 2187,
      "ud": 2188,
      "Ġlow": 2189,
      "ĠEspressif": 2190,
      "Ġet": 2191,
      "template": 2192,
      ">::": 2193,
      "ĠFUSE": 2194,
      "LED": 2195,
      "Ġuser": 2196,
      "requ": 2197,
      "ways": 2198,
      "hs": 2199,
      "Ġclient": 2200,
      "Ġptr": 2201,
      "quence": 2202,
      "THER": 2203,
      "Ġobject": 2204,
      "ility": 2205,
      "resolver": 2206,
      "Ġthen": 2207,
      "ĠSY": 2208,
      "ĠNOT": 2209,
      "org": 2210,
      "Ġcache": 2211,
      "Ġthan": 2212,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2213,
      "ecodableType": 2214,
      "Ġnon": 2215,
      "NS": 2216,
      "su": 2217,
      "ransp": 2218,
      "DF": 2219,
      "LIST": 2220,
      "Identifier": 2221,
      "chip": 2222,
      "ĠStart": 2223,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2224,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2225,
      "SO": 2226,
      "Ġdef": 2227,
      "Ġhw": 2228,
      "Table": 2229,
      "the": 2230,
      "Ġnum": 2231,
      "__)": 2232,
      "ĠByte": 2233,
      "Ġmore": 2234,
      "Ġsame": 2235,
      "Ġheader": 2236,
      "stance": 2237,
      "less": 2238,
      "mm": 2239,
      "Ġparameters": 2240,
      "////////": 2241,
      "TLV": 2242,
      "uth": 2243,
      "HP": 2244,
      "ĠPOR": 2245,
      "connect": 2246,
      "For": 2247,
      "client": 2248,
      "****************************************************************": 2249,
      "Time": 2250,
      "ĠSOFTWARE": 2251,
      "File": 2252,
      "ĠOT": 2253,
      "CACHE": 2254,
      "SUM": 2255,
      "TASK": 2256,
      "Ġgpio": 2257,
      "ĠCO": 2258,
      "COMP": 2259,
      "Ġinformation": 2260,
      "Ġinternal": 2261,
      "Ġargument": 2262,
      "ĠSu": 2263,
      "Ġactual": 2264,
      "Ser": 2265,
      "LC": 2266,
      "SM": 2267,
      "ĠRedistribut": 2268,
      "Index": 2269,
      "tail": 2270,
      "Ġgiv": 2271,
      "CPU": 2272,
      "NAL": 2273,
      "esc": 2274,
      "Ġaddr": 2275,
      "509": 2276,
      "Ġ*)": 2277,
      "hen": 2278,
      "ĠAddress": 2279,
      "._": 2280,
      "ĠSCB": 2281,
      "erify": 2282,
      "ASS": 2283,
      "Ġdriver": 2284,
      "begin": 2285,
      "Ġformat": 2286,
      "link": 2287,
      "ĠValue": 2288,
      "ĠPredefined": 2289,
      "ĠCreate": 2290,
      "GPT": 2291,
      "Ġlimit": 2292,
      "Fi": 2293,
      "pan": 2294,
      "soc": 2295,
      "gisters": 2296,
      "__,": 2297,
      "EndpointId": 2298,
      "Ġline": 2299,
      "ĠDefault": 2300,
      "hai": 2301,
      "block": 2302,
      "anghai": 2303,
      "esponse": 2304,
      "WDT": 2305,
      "Ġallow": 2306,
      "Shanghai": 2307,
      "Ġfloat": 2308,
      "202": 2309,
      "mac": 2310,
      "lob": 2311,
      "arg": 2312,
      "air": 2313,
      "ĠLTD": 2314,
      "Ġbinary": 2315,
      "aramet": 2316,
      "Ġflash": 2317,
      "SPL": 2318,
      "Ġinvalid": 2319,
      "desc": 2320,
      "result": 2321,
      "----------": 2322,
      "ETM": 2323,
      "Ġwhile": 2324,
      "Ġarray": 2325,
      "dcd": 2326,
      "ĠFree": 2327,
      "ĠAn": 2328,
      "NU": 2329,
      "atter": 2330,
      "Ġstack": 2331,
      "Ġobt": 2332,
      "BR": 2333,
      "pcb": 2334,
      "MC": 2335,
      "reak": 2336,
      "DONE": 2337,
      "run": 2338,
      "itch": 2339,
      "ĠWITH": 2340,
      "ĠSource": 2341,
      "Ġaccess": 2342,
      "ĠAll": 2343,
      "Ġserver": 2344,
      "Ġ202": 2345,
      "ivation": 2346,
      "arm": 2347,
      "FE": 2348,
      "Ġspecified": 2349,
      "EQU": 2350,
      "UINT": 2351,
      "class": 2352,
      "wm": 2353,
      "dma": 2354,
      "Ġgiven": 2355,
      "ies": 2356,
      "Ġresponse": 2357,
      "ĠDisable": 2358,
      "SRC": 2359,
      "Ġrange": 2360,
      "ĠXCHAL": 2361,
      "Ġnotice": 2362,
      "aph": 2363,
      "ayer": 2364,
      "OPY": 2365,
      "no": 2366,
      "timer": 2367,
      "ĠDefine": 2368,
      "ĠPIN": 2369,
      "pre": 2370,
      "Ġreset": 2371,
      "IMER": 2372,
      "Ġcopyright": 2373,
      "ib": 2374,
      "Ġrepresent": 2375,
      "ORY": 2376,
      "ĠDA": 2377,
      "sd": 2378,
      "Ġcomm": 2379,
      "BO": 2380,
      "undef": 2381,
      "Ġbase": 2382,
      "VERSION": 2383,
      "Ġwriting": 2384,
      "ITION": 2385,
      "ssion": 2386,
      "Ġconfigure": 2387,
      "Size": 2388,
      "ĠQ": 2389,
      "Ġits": 2390,
      "ension": 2391,
      "ready": 2392,
      "ors": 2393,
      "Ġcount": 2394,
      "Ġsizeof": 2395,
      "ĠError": 2396,
      "Ġhash": 2397,
      "erved": 2398,
      "Ġoption": 2399,
      "av": 2400,
      "XY": 2401,
      "mutex": 2402,
      "icro": 2403,
      "ency": 2404,
      "Ġmodule": 2405,
      "hlo": 2406,
      "Event": 2407,
      "gh": 2408,
      "ablehlo": 2409,
      "index": 2410,
      "Ġiterator": 2411,
      "Ġavailable": 2412,
      "Ġhe": 2413,
      "Ġimplementation": 2414,
      "www": 2415,
      "hether": 2416,
      "DH": 2417,
      "Ġhost": 2418,
      "RECT": 2419,
      "Ġhigh": 2420,
